Dlubal.RFEM5.Material
Material parameters

Dlubal.RFEM5.Material.No
Number

Dlubal.RFEM5.Material.ID
Identifier

Dlubal.RFEM5.Material.Comment
Comment

Dlubal.RFEM5.Material.Tag
Tag

Dlubal.RFEM5.Material.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Material.Description
Description

Dlubal.RFEM5.Material.TextID
Language independent text identifier

Dlubal.RFEM5.Material.UserDefined
User-defined material (read only)

Dlubal.RFEM5.Material.ElasticityModulus
Modulus of elasticity E

Dlubal.RFEM5.Material.ShearModulus
Shear modulus G

Dlubal.RFEM5.Material.PoissonRatio
Poisson's ratio ν

Dlubal.RFEM5.Material.SpecificWeight
Specific weight γ

Dlubal.RFEM5.Material.ThermalExpansion
Coefficient of thermal expansion α

Dlubal.RFEM5.Material.PartialSafetyFactor
Partial safety factor γM

Dlubal.RFEM5.Material.ModelType
Material model type